In [1]:
# data messy
import pandas as pd

In [7]:
data = pd.read_csv('police.csv', encoding='cp949')
# 한글 데이터는 cp949로 encoding 해야하는 경우가 존재한다

In [9]:
data.info()
# 여기서 object는 문자열
# 얘는 무조건 64가 붙는다

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 38 entries, 0 to 37
Data columns (total 90 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   범죄대분류   38 non-null     object
 1   범죄중분류   38 non-null     object
 2   서울      38 non-null     int64
 3   부산      38 non-null     int64
 4   대구      38 non-null     int64
 5   인천      38 non-null     int64
 6   광주      38 non-null     int64
 7   대전      38 non-null     int64
 8   울산      38 non-null     int64
 9   세종      38 non-null     int64
 10  경기 고양   38 non-null     int64
 11  경기 과천   38 non-null     int64
 12  경기 광명   38 non-null     int64
 13  경기 광주   38 non-null     int64
 14  경기 구리   38 non-null     int64
 15  경기 군포   38 non-null     int64
 16  경기 김포   38 non-null     int64
 17  경기 남양주  38 non-null     int64
 18  경기 동두천  38 non-null     int64
 19  경기 부천   38 non-null     int64
 20  경기 성남   38 non-null     int64
 21  경기 수원   38 non-null     int64
 22  경기 시흥   38 non-null     int64
 23  경기 안산   38 non-null     int64
 24  경기 안성   38 non-null     int64
 25  경기 안양   38 non-null     int64
 26  경기 양주   38 non-null     int64
 27  경기 여주   38 non-null     int64
 28  경기 오산   38 non-null     int64
 29  경기 용인   38 non-null     int64
 30  경기 의왕   38 non-null     int64
 31  경기 의정부  38 non-null     int64
 32  경기 이천   38 non-null     int64
 33  경기 파주   38 non-null     int64
 34  경기 평택   38 non-null     int64
 35  경기 포천   38 non-null     int64
 36  경기 하남   38 non-null     int64
 37  경기 화성   38 non-null     int64
 38  강원 강릉   38 non-null     int64
 39  강원 동해   38 non-null     int64
 40  강원 삼척   38 non-null     int64
 41  강원 속초   38 non-null     int64
 42  강원 원주   38 non-null     int64
 43  강원 춘천   38 non-null     int64
 44  강원 태백   38 non-null     int64
 45  충북 제천   38 non-null     int64
 46  충북 청주   38 non-null     int64
 47  충북 충주   38 non-null     int64
 48  충남 계룡   38 non-null     int64
 49  충남 공주   38 non-null     int64
 50  충남 논산   38 non-null     int64
 51  충남 당진   38 non-null     int64
 52  충남 보령   38 non-null     int64
 53  충남 서산   38 non-null     int64
 54  충남 아산   38 non-null     int64
 55  충남 천안   38 non-null     int64
 56  전북 군산   38 non-null     int64
 57  전북 김제   38 non-null     int64
 58  전북 남원   38 non-null     int64
 59  전북 익산   38 non-null     int64
 60  전북 전주   38 non-null     int64
 61  전북 정읍   38 non-null     int64
 62  전남 광양   38 non-null     int64
 63  전남 나주   38 non-null     int64
 64  전남 목포   38 non-null     int64
 65  전남 순천   38 non-null     int64
 66  전남 여수   38 non-null     int64
 67  경북 경산   38 non-null     int64
 68  경북 경주   38 non-null     int64
 69  경북 구미   38 non-null     int64
 70  경북 김천   38 non-null     int64
 71  경북 문경   38 non-null     int64
 72  경북 상주   38 non-null     int64
 73  경북 안동   38 non-null     int64
 74  경북 영주   38 non-null     int64
 75  경북 영천   38 non-null     int64
 76  경북 포항   38 non-null     int64
 77  경남 거제   38 non-null     int64
 78  경남 김해   38 non-null     int64
 79  경남 마산   38 non-null     int64
 80  경남 밀양   38 non-null     int64
 81  경남 사천   38 non-null     int64
 82  경남 양산   38 non-null     int64
 83  경남 진주   38 non-null     int64
 84  경남 창원   38 non-null     int64
 85  경남 통영   38 non-null     int64
 86  제주 서귀포  38 non-null     int64
 87  제주 제주   38 non-null     int64
 88  기타도시    38 non-null     int64
 89  도시이외    38 non-null     int64
dtypes: int64(88), object(2)
memory usage: 26.8+ KB

In [ ]:
data.rename({'서울': '서울특별시'})
# axis를 사용하는 경우가 이렇게 바뀌지 않아서

In [ ]:
data.rename({'서울': '서울특별시'}, axis=1)
# 이때, axis는 0이 default이다
# 얘는 재할당으로 메모리를 많이 차지한다

In [19]:
data.rename({'서울특별시': '서울'}, axis=1, inplace=True)
# 이때, inplcae가 파일에 반영하는 방법이다
# 언제 사용? mutable 아닐때 재할당할때 사용함
# 근데 inplace라는 기능으로 바꿀 수 있음

In [ ]:
data.rename( columns={'서울': '서울특별시'},inplace=True)
# column에 axis 1이 내재되어 있기때문에
# axis를 넣지 않아도 상관이 없다
# functional overloading의 종류 중 하나
data

In [ ]:
data.rename(index={0: '서울'})

In [ ]:
data.rename(columns={'부산': '부산광역시'})

In [ ]:
data.rename(index={1: '가나다라'})

In [ ]:
data.rename(index={1:'가가가'}, columns={'서울특별시': '서울'})

In [ ]:
data.drop(columns = '서울특별시')
# 마찬가지로 index 혹은 columns로 drop이 가능하다
# drop 또한 axis로 버리는 것이 가능하다
# 여러개로 하는것도 가능 이때는 list로

In [ ]:
data.drop(columns=['서울특별시', '부산'])

In [ ]:
data.drop(index=1)

In [ ]:
data['부산']
# structured array

In [ ]:
data.부산
# record array
# 이름에 특수문자 혹은 공백 있을 때 사용 불가능하다
# 특수문자 혹은 공백은 위의 structured array로 사용

In [40]:
# 전체 데이터를 바꾸는 경우가 더 많을 것이다
import seaborn as sns

In [41]:
tips = sns.load_dataset('tips')

In [45]:
mog = sns.load_dataset('mpg')

In [47]:
mog.name.value_counts()
# 1. 전체 특징들을 보는 것이 가능하다
# subgroup - value count
#            아래와 같이 ford pinto가 몇개인지 subgroup 후에 count 하는 것을 value count라고 한다

name
ford pinto             6
toyota corolla         5
amc matador            5
ford maverick          5
chevrolet chevette     4
                      ..
chevrolet monza 2+2    1
ford mustang ii        1
pontiac astro          1
amc pacer              1
chevy s-10             1
Name: count, Length: 305, dtype: int64

In [49]:
tips.describe()
# numpy 에서의 count는 none이 아닌 개수
# 값의 범위를 subgroup을 통해 알 수 있다

       total_bill         tip        size
count  244.000000  244.000000  244.000000
mean    19.785943    2.998279    2.569672
std      8.902412    1.383638    0.951100
min      3.070000    1.000000    1.000000
25%     13.347500    2.000000    2.000000
50%     17.795000    2.900000    2.000000
75%     24.127500    3.562500    3.000000
max     50.810000   10.000000    6.000000

In [50]:
tips[tips.total_bill==3.07]

    total_bill  tip     sex smoker  day    time  size
67        3.07  1.0  Female    Yes  Sat  Dinner     1

In [51]:
# pandas의 map은 확장된 기능이 존재함
# 본래의 functional paradaigm에서
# func + dict로 사용 가능하다 (한 줄에만 적용 가능)
tips.sex.map({'Female': 'F', 'Male': 'M'})

0      F
1      M
2      M
3      M
4      F
      ..
239    M
240    F
241    M
242    M
243    F
Name: sex, Length: 244, dtype: category
Categories (2, object): ['M', 'F']

In [52]:
# 함수로
tips.sex.map(lambda x:x[0])
# 이런식으로 lambda를 사용해서

0      F
1      M
2      M
3      M
4      F
      ..
239    M
240    F
241    M
242    M
243    F
Name: sex, Length: 244, dtype: category
Categories (2, object): ['M', 'F']

In [54]:
mog.name.map(lambda x:x.split(' ')[0]).value_counts()
# split 사용하여 회사만 뽑기
# split 사용하여 공백으로 분리해서 회사명만 뽑는 것도 가능하다

name
ford             51
chevrolet        43
plymouth         31
amc              28
dodge            28
toyota           25
datsun           23
buick            17
pontiac          16
volkswagen       15
honda            13
mercury          11
mazda            10
oldsmobile       10
fiat              8
peugeot           8
audi              7
chrysler          6
vw                6
volvo             6
renault           5
saab              4
subaru            4
opel              4
chevy             3
bmw               2
cadillac          2
maxda             2
mercedes-benz     2
triumph           1
vokswagen         1
mercedes          1
hi                1
capri             1
chevroelt         1
toyouta           1
nissan            1
Name: count, dtype: int64

In [55]:
'ford' in mog.name
# 안됨 왜? string으로 묶여서 안에 있는지 확인이 불가능하기 때문이다

False

In [56]:
import numpy as np

In [62]:
mog[mog.name.isin(['ford'])].value_counts()
# 다시한번 string 내에서 있는 것을 비교하는게 equal 처리로 들어가므로
# 맞는 것이 아무것도 없다

Series([], Name: count, dtype: int64)

In [64]:
# duplicated
mog.duplicated().value_counts()
# 중복값이 몇개인지 알 수있게 해준다

False    398
Name: count, dtype: int64

In [65]:
iris = sns.load_dataset('iris')

In [66]:
iris.duplicated().value_counts()
# 중복이 거슬림
# 중복을 표현하는 방식이 여러개다

False    149
True       1
Name: count, dtype: int64

In [67]:
iris.duplicated(keep=False).value_counts()
# default는 첫번째와 마지막 나온 애들 중 하나는 안쳐주기 때문에
# 1만 나온다

False    148
True       2
Name: count, dtype: int64

In [68]:
iris[iris.duplicated(keep=False)]
# 1. subgrouping
# 2. boolean indexing으로 잘못된 것을 뽑아낸다
# 3. isin은 numpy에서 만든 애들이므로 다른 함수 사용해서 해야함

     sepal_length  sepal_width  petal_length  petal_width    species
101           5.8          2.7           5.1          1.9  virginica
142           5.8          2.7           5.1          1.9  virginica

In [ ]:
# 중복된 애들 drop하는 방법
iris.drop_duplicates()

In [70]:
# 일부만 뽑기
iris[iris.iloc[:,:-1].duplicated()]
# 만약 하나의 attr만 다르면 좀 골치가 아프다

     sepal_length  sepal_width  petal_length  petal_width    species
142           5.8          2.7           5.1          1.9  virginica